Autodesk.Revit.DB.FamilySymbol.SetStructuralSection(Autodesk.Revit.DB.Structure.StructuralSections.StructuralSection)
Sets the structural section in element.
Remarks:
Only beams, braces and structural columns can have a structural section.
To check if the element can have structural section use the Autodesk.Revit.DB.FamilySymbol.CanHaveStructuralSection method.
structuralSection:
Structural section with values that will be set.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was null
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FamilySymbol cannot have a structural section.
Since:
2015

Autodesk.Revit.DB.FamilySymbol.GetStructuralSection
Gets the structural section from element.
Remarks:
Only beams, braces and structural columns can have a structural section.
To check if the element can have structural section use the Autodesk.Revit.DB.FamilySymbol.CanHaveStructuralSection method.
Returns:
The structural section. null if the family symbol does not contain a structural section.
Since:
2015

Autodesk.Revit.DB.FamilySymbol.Origin
The point in the symbol's space corresponding to the insertion point/origin as seen from outside the symbol.
Since:
2027